#ifndef _BG_H_
#define _BG_H_
//=============================================================================
//
// ゲーム背景の処理 [bg.h]
// Author : Konishi Yuuto
//
//=============================================================================

//=============================================================================
// インクルードファイル
//=============================================================================
#include "main.h"
#include "model.h"

//=============================================================================
// マクロ定義
//=============================================================================
#define BG_SIZE_X				(1000)		// 大きさ
#define BG_SIZE_Y				(500)		// 大きさ
#define BG_SIZE_Z				(1000)		// 大きさ

//=============================================================================
// 背景クラス
//=============================================================================
class CBg : public CModel
{
public:
	CBg();		// コンストラクタ
	~CBg();		// デストラクタ

	HRESULT Init(void);		// 初期化処理
	void Uninit(void);		// 終了処理
	void Update(void);		// 更新処理
	void Draw(void);		// 描画処理

	static CBg *Create(void);		// インスタンス生成

private:
	D3DXVECTOR3 m_pos;										// 現在の位置
	D3DXVECTOR3 m_rot;										// 現在の角度
	D3DXVECTOR3 m_size;										// 大きさ
	D3DXMATRIX m_mtxWorld;									// 行列計算用
};

#endif
