#ifndef _CRAB_H_
#define _CRAB_H_
//=============================================================================
//
// 蟹エネミークラスヘッダー [crab.h]
// Author : Konishi Yuuto
//
//=============================================================================

//=============================================================================
// インクルード
//=============================================================================
#include "enemy.h"

//=============================================================================
// マクロ定義
//=============================================================================
#define MOTION_KEYSET_MAX		(32)		// キーセット最大数
#define MAX_CRAB_PARTS			(15)		// モデルのパーツの最大数

//=============================================================================
// エネミークラス
//=============================================================================
class CCrab : public CEnemy
{
public:
	CCrab(int nPriority = PRIORITY_CHARACTER);	// コンストラクタ
	~CCrab();									// デストラクタ

	static CCrab*Create(D3DXVECTOR3 pos, D3DXVECTOR3 size);		// クリエイト

	HRESULT Init(D3DXVECTOR3 pos, D3DXVECTOR3 size);			// 初期化処理
	void Uninit(void);											// 終了処理
	void Update(void);											// 更新処理
	void Draw(void);											// 描画処理
private:
};
#endif