//=============================================================================
//
// 斬撃エフェクトのクラス [slashing_effect.cpp]
// Author : Konishi Yuuto
//
//=============================================================================

//=============================================================================
// インクルード
//=============================================================================
#include "slashing_effect.h"
#include "manager.h"
#include "renderer.h"
#include "xfile.h"

//=============================================================================
// マクロ定義
//=============================================================================
#define MAX_SLASH_LOCUS_EFFECT_TEXTURE	(1)		// 最大数

//=============================================================================
// コンストラクタ
//=============================================================================
CSlashingEffect::CSlashingEffect(PRIORITY Priority) : CModel(Priority)
{
}

//=============================================================================
// デストラクタ
//=============================================================================
CSlashingEffect::~CSlashingEffect()
{

}

//=============================================================================
// クリエイト処理
//=============================================================================
CSlashingEffect * CSlashingEffect::Create(D3DXVECTOR3 pos, D3DXVECTOR3 size)
{
	//3Dポリゴンクラスのポインタ変数
	CSlashingEffect *pLightEffect = new CSlashingEffect;

	//メモリが確保できていたら
	if (pLightEffect != NULL)
	{
		//初期化処理呼び出し
		pLightEffect->Init(pos, size);
	}

	return pLightEffect;
}

//=============================================================================
// 初期化処理
//=============================================================================
HRESULT CSlashingEffect::Init(D3DXVECTOR3 pos, D3DXVECTOR3 size)
{
	// 初期化処理
	CModel::Init(D3DXVECTOR3(pos.x, pos.y - 200.0f, pos.z), size);
	BindModel(CXfile::GetXfile(CXfile::XFILE_NUM_SWORD_LOCUS_EFFECT));
	BindTexture(CXfile::GetXfileTexture(CXfile::XFILE_NUM_SWORD_LOCUS_EFFECT));

	return S_OK;
}

//=============================================================================
// 終了処理
//=============================================================================
void CSlashingEffect::Uninit(void)
{
	// 終了処理
	CModel::Uninit();
}

//=============================================================================
// 更新処理
//=============================================================================
void CSlashingEffect::Update(void)
{
	// 更新処理
	CModel::Update();

	// もしテクスチャのパターン数が最大数を超えたら
//	if (GetTexPattern() >= MAX_SLASH_LOCUS_EFFECT_TEXTURE)
	{
		// 終了処理
	//	Uninit();
	}
}

//=============================================================================
// 描画処理
//=============================================================================
void CSlashingEffect::Draw(void)
{
	// 描画処理
	CModel::Draw();
}