#ifndef _TITLE_H_
#define _TITLE_H_
//=============================================================================
//
// タイトルクラスヘッダー [title.h]
// Author : Konishi Yuuto
//
//=============================================================================

//=============================================================================
// インクルードファイル
//=============================================================================
#include "scene.h"

//=============================================================================
// マクロ定義
//=============================================================================

//=============================================================================
// 前方宣言
//=============================================================================
class CTitleBg;
class CTitlelogo;

//=============================================================================
// タイトルクラス
//=============================================================================
class CTitle : public CScene
{
public:
	CTitle(PRIORITY Priority = PRIORITY_0);					// コンストラクタ
	~CTitle();											// デストラクタ

	static CTitle* Create(void);						// オブジェクト生成関数
	HRESULT Init(D3DXVECTOR3 pos, D3DXVECTOR3 size);	// 初期化処理
	void Uninit(void);									// 終了処理
	void Update(void);									// 更新処理
	void Draw(void);									// 描画処理
	
	// Get関数
	static CTitleBg *GetTitleBg(void) { return m_pTitleBg; }	// タイトルロゴの情報
	static CTitlelogo *GetTitleLogo(void) { return m_pTitlelogo; }	// タイトルロゴの情報

private:
	static CTitleBg *m_pTitleBg;		// タイトル背景のポインタ
	static CTitlelogo *m_pTitlelogo;	// タイトルロゴのポインタ
};

#endif // !_TITEL_H_