#ifndef _XFILE_H_
#define _XFILE_H_
//=============================================================================
//
// Xファイル管理ヘッダー [xfile.h]
// Author : Konishi Yuuto
//
//=============================================================================

//=============================================================================
// インクルード
//=============================================================================
#include "main.h"
#include "model.h"

//=============================================================================
// マクロ定義
//=============================================================================
#define MAX_XFILE			(256)		// モデルの最大
#define MAX_XFILE_TEXTURE	(256)		// テクスチャの最大
#define MAX_NAME_NUM		(1024)		// 名前の最大

//=============================================================================
//クラス宣言
//=============================================================================
class CXfile
{
public:

	// テクスチャの番号の列挙型
	typedef enum
	{
		XFILE_NUM_NONE = -1,		// 初期値
		XFILE_NUM_BG,				// 背景
		XFILE_NUM_MAX
	}XFILE_NUM;

	CXfile();		// コンストラクタ
	~CXfile();		// デストラクタ

	static HRESULT ModelLoad(void);								// モデルロード
	static void ModelUnLoad(void);								// モデルアンロード
	static CModel::MODEL GetXfile(XFILE_NUM Tex_Num);			// モデルの情報
private:
	static CModel::MODEL m_aXfile[MAX_XFILE];					// Xファイル情報の構造体
};
#endif
